# Pandas

Using the heart-attack.csv example below, fill in the code blocks for a new dataset, auto-mpg

The first step is to download the auto-mpg data set (auto-mpg.data and auto-mpg.names) from UCI: https://archive.ics.uci.edu/ml/datasets/Auto%2BMPG

In this file, replace gender with origin and age with mpg

## Resources
1. Ch 5-6 in Python for Data Analysis, 2nd Ed, Wes McKinney (UCalgary library and https://github.com/wesm/pydata-book)
2. Ch 3 in Python Data Science Handbook, Jake VanderPlas (Ucalgary library and https://github.com/jakevdp/PythonDataScienceHandbook)

First, import Pandas and NumPy:

In [2]:
import numpy as np
import pandas as pd

## Load data from file

Most often data will come from somewhere, often csv files, and using `pd.read_csv()` will allow smooth creation of DataFrames.

Let's load the required dataset:

In [3]:
# Replace code below with code to load auto-mpg dataset
# Hint: Use attribute information from website to determine column names
# Hint: Load with na_values = '?' and sep=r'\s+'
data = pd.read_csv('heart-attack.csv')

After loading data, it is good practice to check what we have. Usually, the sequences is:
1. Check dimension
2. Peek at the first rows
3. Get info on data types and missing values
4. Summarize columns

In [4]:
# Check dimension (rows, columns) 
data.shape

(293, 14)

In [5]:
# Peek at the first rows
data.head()

,age,gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,28,1,2,130,132,0,2,185,0,0.0,?,?,?,0
1,29,1,2,120,243,0,0,160,0,0.0,?,?,?,0
2,29,1,2,140,?,0,0,170,0,0.0,?,?,?,0
3,30,0,1,170,237,0,1,170,0,0.0,?,?,6,0
4,31,0,2,100,219,0,1,150,0,0.0,?,?,?,0

In [6]:
# Column names are
data.columns

Index(['age', 'gender', 'cp', 'trestbps', 'chol', 'fbs', 'restecg', 'thalach',
       'exang', 'oldpeak', 'slope', 'ca', 'thal', 'num'],
      dtype='object')

In [7]:
# Get info on data types and missing values
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293 entries, 0 to 292
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       293 non-null    int64
 1   gender    293 non-null    int64
 2   cp        293 non-null    int64
 3   trestbps  293 non-null    object
 4   chol      293 non-null    object
 5   fbs       293 non-null    object
 6   restecg   293 non-null    object
 7   thalach   293 non-null    object
 8   exang     293 non-null    object
 9   oldpeak   293 non-null    float64
 10  slope     293 non-null    object
 11  ca        293 non-null    object
 12  thal      293 non-null    object
 13  num       293 non-null    int64
dtypes: float64(1), int64(4), object(9)
memory usage: 32.2+ KB

## Summarize values
What is the mean, std, min, max in each column?

In [8]:
data.median

<bound method DataFrame.median of      age  gender  cp trestbps chol fbs restecg thalach exang  oldpeak slope  \
0     28       1   2      130  132   0       2     185     0      0.0     ?
1     29       1   2      120  243   0       0     160     0      0.0     ?
2     29       1   2      140    ?   0       0     170     0      0.0     ?
3     30       0   1      170  237   0       1     170     0      0.0     ?
4     31       0   2      100  219   0       1     150     0      0.0     ?
..   ...     ...  ..      ...  ...  ..     ...     ...   ...      ...   ...
288   52       1   4      140  266   0       0     134     1      2.0     2
289   52       1   4      160  331   0       0      94     1      2.5     ?
290   54       0   3      130  294   0       1     100     1      0.0     2
291   56       1   4      155  342   1       0     150     1      3.0     2
292   58       0   2      180  393   0       0     110     1      1.0     2

    ca thal  num
0    ?    ?    0
1    ?    ?    0
2    ?    ?    0
3    ?    6    0
4    ?    ?    0
..  ..  ...  ...
288  ?    ?    1
289  ?    ?    1
290  ?    ?    1
291  ?    ?    1
292  ?    7    1

[293 rows x 14 columns]>

In [9]:
# where are the other columns? Check data types
data.dtypes

age           int64
gender        int64
cp            int64
trestbps     object
chol         object
fbs          object
restecg      object
thalach      object
exang        object
oldpeak     float64
slope        object
ca           object
thal         object
num           int64
dtype: object

Now we can describe all columns, meaning printing basic statistics. Note that by default Pandas ignores NaN, whereas NumPy does not.

In [10]:
data.describe() # ignores NaN

              age      gender          cp     oldpeak         num
count  293.000000  293.000000  293.000000  293.000000  293.000000
mean    47.767918    0.723549    2.979522    0.584642    0.358362
std      7.760150    0.448007    0.964928    0.909879    0.480340
min     28.000000    0.000000    1.000000    0.000000    0.000000
25%     42.000000    0.000000    2.000000    0.000000    0.000000
50%     49.000000    1.000000    3.000000    0.000000    0.000000
75%     54.000000    1.000000    4.000000    1.000000    1.000000
max     66.000000    1.000000    4.000000    5.000000    1.000000

We could be interested by these statistics in each of the values from one column. To get these, we first group values by those values, then ask for the description. We will only look at one separate variable for clarity

In [11]:
# Replace variables to correspond to auto-mpg dataset
data.groupby(by='gender').describe().age

        count       mean       std   min   25%   50%   75%   max
gender
0        81.0  47.654321  7.304383  30.0  43.0  48.0  53.0  62.0
1       212.0  47.811321  7.943656  28.0  41.0  49.0  54.0  66.0

## Find NaNs
How many NaNs in each column?

We can ask which entries are null, which produces a boolean array

In [12]:
data.isnull()

,age,gender,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,num
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
288,False,False,False,False,False,False,False,False,False,False,False,False,False,False
289,False,False,False,False,False,False,False,False,False,False,False,False,False,False
290,False,False,False,False,False,False,False,False,False,False,False,False,False,False
291,False,False,False,False,False,False,False,False,False,False,False,False,False,False
292,False,False,False,False,False,False,False,False,False,False,False,False,False,False

Applying `sum()` to this boolean array will count the number of `True` values in each column

In [66]:
data.isnull().sum()

age         0
gender      0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
num         0
dtype: int64

We get complementary information from `info()`

In [67]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 293 entries, 0 to 292
Data columns (total 14 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       293 non-null    int64
 1   gender    293 non-null    int64
 2   cp        293 non-null    int64
 3   trestbps  293 non-null    object
 4   chol      293 non-null    object
 5   fbs       293 non-null    object
 6   restecg   293 non-null    object
 7   thalach   293 non-null    object
 8   exang     293 non-null    object
 9   oldpeak   293 non-null    float64
 10  slope     293 non-null    object
 11  ca        293 non-null    object
 12  thal      293 non-null    object
 13  num       293 non-null    int64
dtypes: float64(1), int64(4), object(9)
memory usage: 32.2+ KB

We can fill (replace) these missing values, for example with the minimum value in each column

In [13]:
data.fillna(data.min()).describe()

              age      gender          cp     oldpeak         num
count  293.000000  293.000000  293.000000  293.000000  293.000000
mean    47.767918    0.723549    2.979522    0.584642    0.358362
std      7.760150    0.448007    0.964928    0.909879    0.480340
min     28.000000    0.000000    1.000000    0.000000    0.000000
25%     42.000000    0.000000    2.000000    0.000000    0.000000
50%     49.000000    1.000000    3.000000    0.000000    0.000000
75%     54.000000    1.000000    4.000000    1.000000    1.000000
max     66.000000    1.000000    4.000000    5.000000    1.000000

## Count unique values (a histogram)

We finish off, with our good friend the histogram

In [12]:
# Replace code to correspond to relevant auto-mpg variable
data['age'].value_counts()

age
54    25
48    19
52    17
49    15
55    15
46    13
53    12
43    12
50    12
41    11
39    11
56    10
47    10
51     9
58     9
45     8
59     8
37     8
40     7
42     7
38     7
44     7
57     5
36     5
35     5
34     4
32     4
29     2
31     2
33     2
62     2
65     2
60     2
61     2
30     1
28     1
63     1
66     1
Name: count, dtype: int64